{
    "EN": {
        "summaryButtonLabel": "Summary",
        "educationButtonLabel": "Education",
        "experienceButtonLabel": "Experience",
        "summary": "Junior Full Stack Developer with experience in Angular, Flutter, NestJS, MySQL, PostgreSQL, Firebase, and MongoDB. Knowledge in Object-Oriented Programming, Clean Architecture, and scalable modular architectures. Experience in designing and implementing REST and RESTful APIs with NestJS, developing npm libraries, documentation with Swagger, and API testing with Postman. Basic knowledge in Docker and experience in interface customization with Shopify, Liquid, and Canva.",
        "education": [
            {
                "studyTitle": "Technical Bachelor's Degree with a Specialization in Graphic Design and Development.",
                "studyPlace": "Instituto Técnico Industrial Julio Flórez."
            },
            {
                "studyTitle": "Course in Web Design with HTML and JavaScript.",
                "studyPlace": "SENA - CIMM."
            },
            {
                "studyTitle": "Software Analysis and Development Technology.",
                "studyPlace": "SENA - CIMM."
            }
        ],
        "experience": [
            {
                "jobTitle": "Web Development",
                "companyName": "BIOWEB SAS.",
                "dateInterval": "Sep 31 2024 - Sep 19 2025.",
                "description": "Development of HTML5 and CSS instances for products on sales websites, editing internal code with Angular, Firebase with Kanban and Scrum methodologies, remote."
            }
        ],
        "projectsButtonLabel": "Projects",
        "projects": [
            {
                "projectName": "Personal Portfolio",
                "dateInterval": "September 2025 - Present",
                "description": "Development of a professional portfolio using Angular to showcase personal projects and technical skills."
            },
            {
                "projectName": "Workspace Library Development",
                "dateInterval": "December 23, 2025 Present",
                "description": "Development of a modular library workspace for reusable components and logic."
            }
        ]
    },
    "ES": {
        "summaryButtonLabel": "Resumen",
        "educationButtonLabel": "Educación",
        "experienceButtonLabel": "Experiencia",
        "summary": "Desarrollador Full Stack Junior con experiencia en Angular, Flutter, NestJS, MySQL, PostgreSQL, Firebase y MongoDB. Conocimientos en Programación Orientada a Objetos, Arquitectura Limpia y arquitecturas modulares escalables. Experiencia en diseño e implementación de APIs REST y RESTful con NestJS, desarrollo de librerías npm, documentación con Swagger y pruebas con Postman. Conocimientos básicos en Docker y experiencia en personalización de interfaces con Shopify, Liquid y Canva.",
        "education": [
            {
                "studyTitle": "Bachiller Técnico con Especialización en Desarrollo y Diseño Gráfico.",
                "studyPlace": "Instituto Técnico Industrial Julio Flórez."
            },
            {
                "studyTitle": "Curso de Diseño Web con HTML y JavaScript.",
                "studyPlace": "SENA - CIMM."
            },
            {
                "studyTitle": "Tecnología en Análisis y Desarrollo de Software.",
                "studyPlace": "SENA - CIMM."
            }
        ],
        "experience": [
            {
                "jobTitle": "Desarrollo Web",
                "companyName": "BIOWEB SAS.",
                "dateInterval": "Sep 31 2024 - Sep 19 2025.",
                "description": "Desarrollo de instancias HTML5 y CSS para productos en sitios web de ventas, edición de código interno con Angular y Firebase bajo metodologías Kanban y Scrum, trabajo remoto."
            }
        ],
        "projectsButtonLabel": "Proyectos",
        "projects": [
            {
                "projectName": "Portafolio Personal",
                "dateInterval": "Septiembre 2025 - Presente",
                "description": "Desarrollo un portafolio profesional utilizando Angular para mostrar proyectos personales y habilidades técnicas."
            },
            {
                "projectName": "Desarrollo del Espacio de Trabajo de Bibliotecas",
                "dateInterval": "Diciembre 23, 2025 Presente",
                "description": "Desarrollo de un espacio de trabajo de biblioteca modular para componentes y lógica reutilizables."
            }
        ]
    }
}